/* 
Временная таблица, для удобства вывода всех 
транзакций с суммой выше средней
*/

-- 1. Создание временной таблицы
CREATE TEMP TABLE temp_avg_amount AS
SELECT AVG(amount) as global_avg
FROM transactions;

-- 2. Проверка, что она создалась
SELECT * FROM temp_avg_amount;

-- 3. Использование её в сложном запросе
SELECT t.tx_id, t.amount, tmp.global_avg
FROM transactions t
CROSS JOIN temp_avg_amount tmp
WHERE t.amount > tmp.global_avg
LIMIT 10;

/*
Данный код выведет примерно следующее:

"tx_id"	"amount"	"global_avg"
2		 49323.31	 25157.111348000000
3		 45057.30	 25157.111348000000
4		 47964.33	 25157.111348000000
5		 45572.66	 25157.111348000000
6		 31981.61	 25157.111348000000
8		 39862.55	 25157.111348000000
9		 25397.18	 25157.111348000000
11		 33225.74	 25157.111348000000
12		 44348.14	 25157.111348000000
15		 30501.12	 25157.111348000000
*/